app/Controllers/Barang.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // Jumlah data per halaman

        if ($keyword) {
            $barang = $this->barangModel->search($keyword, $perPage);
        } else {
            $barang = $this->barangModel->paginate($perPage);
---
SELECT *
FROM `barang`
SELECT *
FROM `barang`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `barang`