app/Controllers/Beli.php

    public function byTransaksi($id_transaksi)
    {
        $data['title'] = 'Data Transaksi Pembelian';
        $model = new BeliModel();
        $transaksiModel = new TransaksiModel();
        $barangModel = new BarangModel();

        // Ambil data pembelian berdasarkan id_transaksi
        $data['beli'] = $model->select('beli.*, barang.nama, barang.harga')
            ->join('barang', 'barang.id = beli.id_barang')
            ->where('beli.id_transaksi', $id_transaksi)
            ->findAll();

        // Ambil detail transaksi, termasuk nama pembeli dan pegawai
        $data['transaksi'] = $transaksiModel->select('transaksi.*, pembeli.nama AS nama_pembeli, pegawai.nama AS nama_pegawai')
            ->join('pembeli', 'pembeli.id = transaksi.id_pembeli')
            ->join('pegawai', 'pegawai.id = transaksi.id_pegawai')
            ->where('transaksi.id', $id_transaksi)
            ->first();

        $data['barang'] = $barangModel->findAll(); // Data barang untuk dropdown
---
SELECT `beli`.*, `barang`.`nama`, `barang`.`harga`
FROM `beli`
JOIN `barang` ON `barang`.`id` = `beli`.`id_barang`
WHERE `beli`.`id_transaksi` = '31'
SELECT `transaksi`.*, `pembeli`.`nama` AS `nama_pembeli`, `pegawai`.`nama` AS `nama_pegawai`
FROM `transaksi`
JOIN `pembeli` ON `pembeli`.`id` = `transaksi`.`id_pembeli`
JOIN `pegawai` ON `pegawai`.`id` = `transaksi`.`id_pegawai`
WHERE `transaksi`.`id` = '31'
 LIMIT 1
SELECT *
FROM `barang`