app/Controllers/Pegawai.php

SELECT *
FROM `pegawai`
SELECT *
FROM `pegawai`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pegawai`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // Jumlah data per halaman

        if ($keyword) {
            $pegawai = $this->pegawaiModel->search($keyword, $perPage);
        } else {
            $pegawai = $this->pegawaiModel->paginate($perPage);