app/Controllers/Pembeli.php

SELECT *
FROM `pembeli`
SELECT *
FROM `pembeli`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pembeli`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $perPage = 10; // Jumlah data per halaman

        if ($keyword) {
            $pembeli = $this->pembeliModel->search($keyword, $perPage);
        } else {
            $pembeli = $this->pembeliModel->paginate($perPage);