app/Controllers/Transaksi.php

    public function edit($id)
    {
        $data['title']     = 'Edit transaksi';
        $model = new transaksiModel();
        $data['transaksi'] = $model->find($id);
---
SELECT *
FROM `transaksi`
WHERE `transaksi`.`id` = '29'