app/Controllers/Transaksi.php

    public function create()
    {
        $model = new PembeliModel();
        $data['pembeli'] = $model->findAll();

        $model = new PegawaiModel();
        $data['pegawai'] = $model->findAll();
---
SELECT *
FROM `pegawai`
SELECT *
FROM `pembeli`

    public function edit($id)
    {
        $data['title']     = 'Edit transaksi';
        $model = new transaksiModel();
        $data['transaksi'] = $model->find($id);
---
SELECT *
FROM `transaksi`
WHERE `transaksi`.`id` = '30'