app/Models/BeliModel.php

    public function getAll()
    {
        return $this->select('beli.*, transaksi.tanggal, barang.nama, barang.harga')
            ->join('transaksi', 'transaksi.id = beli.id_transaksi')
            ->join('barang', 'barang.id = beli.id_barang')
            ->findAll();
---
SELECT `beli`.*, `transaksi`.`tanggal`, `barang`.`nama`, `barang`.`harga`
FROM `beli`
JOIN `transaksi` ON `transaksi`.`id` = `beli`.`id_transaksi`
JOIN `barang` ON `barang`.`id` = `beli`.`id_barang`

    public function getAllBeli($keyword = null, $perPage = 10)
    {
        $builder = $this->table('beli'); // Gunakan Query Builder bawaan CI4
        $builder->select('beli.*, barang.nama AS nama_barang, transaksi.tanggal AS tanggal_transaksi, barang.harga AS harga_barang');
        $builder->join('barang', 'barang.id = beli.id_barang');
        $builder->join('transaksi', 'transaksi.id = beli.id_transaksi');

        if ($keyword) {
            $builder->groupStart()
                ->like('barang.nama', $keyword)
                ->orLike('transaksi.tanggal', $keyword)
                ->groupEnd();
        }

        return $builder->paginate($perPage);
---
SELECT COUNT(*) AS `numrows`
FROM `beli`
JOIN `barang` ON `barang`.`id` = `beli`.`id_barang`
JOIN `transaksi` ON `transaksi`.`id` = `beli`.`id_transaksi`
SELECT `beli`.*, `barang`.`nama` AS `nama_barang`, `transaksi`.`tanggal` AS `tanggal_transaksi`, `barang`.`harga` AS `harga_barang`
FROM `beli`
JOIN `barang` ON `barang`.`id` = `beli`.`id_barang`
JOIN `transaksi` ON `transaksi`.`id` = `beli`.`id_transaksi`
 LIMIT 10