app/Models/PegawaiModel.php

SELECT *
FROM `pegawai`
WHERE `nama` = 'maldin'
 LIMIT 1
---
    public function getPegawaiByNama($nama)
    {
        return $this->where('nama', $nama)->first();