app/Models/TransaksiModel.php

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
JOIN `pegawai` ON `pegawai`.`id` = `transaksi`.`id_pegawai`
JOIN `pembeli` ON `pembeli`.`id` = `transaksi`.`id_pembeli`
SELECT `transaksi`.*, `pembeli`.`nama` AS `nama_pembeli`, `pegawai`.`nama` AS `nama_pegawai`
FROM `transaksi`
JOIN `pegawai` ON `pegawai`.`id` = `transaksi`.`id_pegawai`
JOIN `pembeli` ON `pembeli`.`id` = `transaksi`.`id_pembeli`
 LIMIT 10
---
    public function getAllTransaksi($keyword = null, $perPage = 10)
    {
        $builder = $this->table('transaksi'); // Menggunakan query builder CodeIgniter
        $builder->select('transaksi.*, pembeli.nama AS nama_pembeli, pegawai.nama AS nama_pegawai');
        $builder->join('pegawai', 'pegawai.id = transaksi.id_pegawai');
        $builder->join('pembeli', 'pembeli.id = transaksi.id_pembeli');

        if ($keyword) {
            $builder->groupStart() // Hindari kesalahan dalam OR
                ->like('pembeli.nama', $keyword)
                ->orLike('transaksi.tanggal', $keyword)
                ->groupEnd();
        }

        return $builder->paginate($perPage);